000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СостояниеЗапросаДоступностиТоваров/СостояниеЗапросаДоступностиТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостояниеЗапросаДоступностиТоваров</name>
  <resources>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Рассмотрен</name>
    <comment>Был ответ от внешней системы после отправки</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Обеспечение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЧастичноОбеспечено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.Магазины</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ЗапросДоступностиТоваров</name>
    <type>
      <types>DocumentRef.ЗапросДоступностиТоваров</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючСвязи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СтатусыЗапросовДоступностиТоваровШапка/СтатусыЗапросовДоступностиТоваровШапка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗапросовДоступностиТоваровШапка</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Удалён</name>
  </enumValues>
  <enumValues>
    <name>КОтправке</name>
  </enumValues>
  <enumValues>
    <name>Отменён</name>
  </enumValues>
  <enumValues>
    <name>Изменён</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Сборка</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаКассе</name>
  </enumValues>
  <enumValues>
    <name>ПродажаБезнал</name>
  </enumValues>
  <enumValues>
    <name>ЧастичноСогласован</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>Получен</name>
  </enumValues>
  <enumValues>
    <name>ПодтвердитьОтмену</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/СостояниеЗапросаДоступностиТоваров/ManagerModule.bsl
Процедура ЗаписьСостояниеЗапросаДоступностиТоваров(ЗапросДоступности) Экспорт
	
	НаборЗаписей = РегистрыСведений.СостояниеЗапросаДоступностиТоваров.СоздатьНаборЗаписей();
	НаборЗаписей.ОбменДанными.Загрузка = Истина;
	НаборЗаписей.Отбор.ЗапросДоступностиТоваров.Установить(ЗапросДоступности);   
	
	ТЗЗапросаДоступности = НаборЗаписей.Выгрузить();
	
	ТЗЗапросаДоступности = ИзменениеОбеспечения(ТЗЗапросаДоступности, ЗапросДоступности);
	
	
	НаборЗаписей.Загрузить(ТЗЗапросаДоступности); 
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры   

Функция ИзменениеОбеспечения(ТЗ, ЗапросДоступности) 
	
	Если ЗапросДоступности.МагазинОтправитель = ЗапросДоступности.МагазинПолучатель Тогда 
		
		Обеспечение = Истина;
		
		Если ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Изменён Тогда 
			
			Обеспечение = Ложь; 
			
		КонецЕсли;
		
		Если ЗапросДоступности.СтатусЗапроса = Перечисления.СтатусыЗапросовДоступностиТоваровШапка.Согласован Тогда 
			
			
			Для Каждого СтрокаТЧ Из ЗапросДоступности.Товары Цикл
				
				ЧастичноОбеспечено = Не (СтрокаТЧ.Количество = СтрокаТЧ.КоличествоТребование);
				
				ОтборСтроки = Новый Структура();
				ОтборСтроки.Вставить("КлючСвязи", СтрокаТЧ.КлючСвязи);
				Строки = ТЗ.НайтиСтроки(ОтборСтроки); 
				
				Если Строки.Количество() > 0 Тогда
					Строки[0].Обеспечение = Обеспечение И Не ЧастичноОбеспечено;
					Строки[0].ЧастичноОбеспечено = ЧастичноОбеспечено;
				Иначе
					
					НоваяСтрока = ТЗ.Добавить();
					НоваяСтрока.ЗапросДоступностиТоваров = ЗапросДоступности;  
					НоваяСтрока.КлючСвязи = СтрокаТЧ.КлючСвязи;  
					НоваяСтрока.Обеспечение = Обеспечение И Не ЧастичноОбеспечено;
					НоваяСтрока.ЧастичноОбеспечено = ЧастичноОбеспечено;
					
				КонецЕсли;			
				
				
			КонецЦикла;
			
		КонецЕсли; 
	КонецЕсли; 
	
	Возврат ТЗ;
	
КонецФункции
